Public Member Functions | Friends | List of all members
ACAPI::MEP::EquipmentUIManager Class Referencefinal
MEP Element Manager
The EquipmentUIManager contains UI-related services for an Equipment . More...
#include <MEPEquipmentUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::EquipmentUIManager:
 Public Member Functions
Result< EquipmentDefault >  | CreateEquipmentDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a EquipmentDefault from a toolUIData.
Result< void >  | ApplyEquipmentDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const EquipmentDefault &equipmentDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< EquipmentUIManager >  | CreateEquipmentUIManager ()
Creates a EquipmentUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The EquipmentUIManager contains UI-related services for an Equipment .
Since
Archicad 28
Member Function Documentation
◆ ApplyEquipmentDefaultToToolUIData()
 Result< void > ACAPI::MEP::EquipmentUIManager::ApplyEquipmentDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const EquipmentDefault & |  equipmentDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
equipmentDefault | The default to be set
Returns
Returns error if the EquipmentDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateEquipmentDefaultFromToolUIData()
 Result< EquipmentDefault > ACAPI::MEP::EquipmentUIManager::CreateEquipmentDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a EquipmentDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Equipment in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an EquipmentDefault, otherwise returns the EquipmentDefault created from it.
Friends And Related Symbol Documentation
◆ CreateEquipmentUIManager
 Result< EquipmentUIManager > CreateEquipmentUIManager  |  ( |   | )
friend
Creates a EquipmentUIManager.
Returns
If able, creates a new manager for Equipment, otherwise Error.